app/controllers/gists_controller.rb

def search
@gists = Gist.search(params[:lang])
---
SELECT "gists".* FROM "gists" WHERE (lang LIKE '%dylan session%')

  def create
    @gist = Gist.new(gist_params)

    respond_to do |format|
      if @gist.save
---
INSERT INTO "gists" ("created_at", "description", "lang", "snippet", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 12 Mar 2014 17:06:18 UTC +00:00], ["description", ""], ["lang", ""], ["snippet", ""], ["updated_at", Wed, 12 Mar 2014 17:06:18 UTC +00:00]]

  def update
    respond_to do |format|
      if @gist.update(gist_params)
---
UPDATE "gists" SET "snippet" = ?, "lang" = ?, "description" = ?, "updated_at" = ? WHERE "gists"."id" = 2  [["snippet", "dfsdf"], ["lang", "sdfsdf"], ["description", "sdfsdf"], ["updated_at", Wed, 12 Mar 2014 17:06:50 UTC +00:00]]

  def destroy
    @gist.destroy
---
DELETE FROM "gists" WHERE "gists"."id" = ?  [["id", 3]]

    def set_gist
      @gist = Gist.find(params[:id])
---
SELECT "gists".* FROM "gists" WHERE "gists"."id" = ? LIMIT 1  [["id", "3"]]