app/controllers/gists_controller.rb

  def index
 @gists = Gist.all
---
SELECT "gists".* FROM "gists"